Repository: alisheraxmedov/flutter_audio_recorder
Catalog: lib/l10n/app_*.arb
Languages: uz

# appTitle
source: Voice Recorder
uz: Ovoz Yozuvchisi

# statusReady
source: Ready to record
uz: Yozishga tayyor

# statusRecording
source: Recording...
uz: Yozilmoqda...

# statusSaved
source: Saved to: {path}
uz: Saqlandi: {path}

# permissionDeniedTitle
source: Permission Denied
uz: Ruxsat etilmadi

# permissionDeniedMessage
source: Microphone permission is required to record audio.
uz: Ovoz yozish uchun mikrofonga ruxsat kerak.

# allRecordsTitle
source: All Records
uz: Barcha yozuvlar

# settingsTitle
source: Settings
uz: Sozlamalar

source: Language
uz: Til

source: English
uz: Ingliz tili

source: Uzbek
uz: O'zbek tili

source: Russian
uz: Rus tili

source: No records found
uz: Hozircha yozuvlar yo'q

# deleteRecordingTitle
source: Delete Recording?
uz: Yozuvni o'chirishni xohlaysizmi?

# deleteRecordingMessage
source: Are you sure you want to delete "{name}"?
uz: "{name}" ni o'chirishni xohlaysizmi?

source: Cancel
uz: Bekor qilish

source: Delete
uz: O'chirish

source: Rename Recording
uz: Yozuv nomini o'zgartirish

source: Enter new name
uz: Yangi nom kiriting

source: Rename
uz: O'zgartirish
